//
//  AboutVC.swift
//  OnisPos
//
//  Created by MG on 4/13/20.
//  Copyright © 2020 MG. All rights reserved.
//

import UIKit

class AboutVC: BaseViewController, UITableViewDelegate, UITableViewDataSource {
    @IBOutlet weak var tableMain: UITableView!
    var headerList = ["Борлуулалт хийх","Буцаалт","Принтер тохируулах","Тайлан харах","Тохиргоо хийх","Нууц үг солих","Лиценз сунгах","Үйлчилгээний нөхцөл","Холбоо барих"]
    var listExpand = [true, true, true, true, true, true, true, true, true]
    var listText: [NSAttributedString] = []
    
    override func viewDidLoad() {
        super.viewDidLoad()
        addSlideMenuButton(false)
        
        self.title = "Програмын тухай"
        
        
        let text1 = NSMutableAttributedString()
        let text2 = NSMutableAttributedString()
        let text3 = NSMutableAttributedString()
        let text4 = NSMutableAttributedString()
        let text5 = NSMutableAttributedString()
        let text6 = NSMutableAttributedString()
        let text7 = NSMutableAttributedString()
        let text8 = NSMutableAttributedString()
        let text9 = NSMutableAttributedString()
        
        let text1_1 = NSAttributedString(string: "Борлуулалтын цонхны дүн хэсэгт борлуулсан барааныхаа дүнг оруулаад Төлбөр товчийг дарна. Төлсөн гэдэг талбарт худалдан авагчийн төлсөн дүнг оруулна. Хувь хүнд эсвэл байгууллагад баримт гаргаж өгөхөө сонгоно. \nХувь хүн: Илгээх үйлдлээр утасны дугаар оруулсан бол тухай хэрэглэгчийн дугаар луу баримтыг илгээнэ. Имэйл хаяг оруулсан бол имэйлээр илгээх боломжтой.Хэвлэх үйлдлээр НӨАТ-н баримтыг хэвлэнэ. \nБайгууллага: Албан байгууллагын татвар төлөгчийн дугаарыг оруулж хэвлэх үйлдлээр НӨАТ-н баримтыг хэвлэнэ.", attributes: [NSAttributedString.Key.font: UIFont.systemFont(ofSize: 16)])
        
        let text2_1 = NSAttributedString(string: "Борлуулалтын буцаалт хийхдээ баримтын дугаараар бүтэн буцаалт хийх боломжтой. \nТа баримтын дугаар хэсэгт борлуулалтын баримтын дугаарыг оруулж шалгах үйлдлийг хийх бөгөөд зөв баримтын дугаар оруулсан тохиолдолд тухайн баримтын мэдээллийг татах бөгөөд Төлбөр товчийг дарснаар тухайн баримтын гүйлгээг буцаана.", attributes: [NSAttributedString.Key.font: UIFont.systemFont(ofSize: 16)])
        
        let text3_1 = NSAttributedString(string: "Та bluetooth хэвлэгч төхөөрөмжөө асаагаад function товчийг дарж хэвлэгч төхөөрөмжийн тохиргооны мэдээлэл бүхий хуудсыг хэвлэж авна. \nҮүний дараа гар утасны bluetooth тохиргоог асаах бөгөөд хэвлэгч төхөөрөмжөө сонгоод пин код оруулах талбарт хэвлэсэн баримтан дахь пин кодыг оруулна.", attributes: [NSAttributedString.Key.font: UIFont.systemFont(ofSize: 16)])
        
        let text4_1 = NSAttributedString(string: "Тайлан цэсрүү орж борлуулалтын тайланг өдөр, сар, жилээр харах боломжтой. \nӨдрөөр: Та сараа сонгож харах товч дарна. Таны сонгосон сарын борлуулалтын тайлан өдөр өдрөөр нь нэгтгэж харуулна. \nСараар: Та жилээ сонгож харах товч дарна. Таны сонгосон жилийн борлуулалтын тайланг сар сараар нь нэгтгэж харуулна.\nЖилээр: Таны програм ашиглаж эхэлснээс хойших нийт борлуулалтын тайланг жил жилээр нь нэгтгэж харуулна.", attributes: [NSAttributedString.Key.font: UIFont.systemFont(ofSize: 16)])
        
        let text5_1 = NSAttributedString(string: "Тохиргоо цэсрүү орж дэлгүүрийн мэдээллээ засварлах боломжтой.", attributes: [NSAttributedString.Key.font: UIFont.systemFont(ofSize: 16)])
        
        let text6_1 = NSAttributedString(string: "Тохиргоо цэсрүү орж Нууц үг солих товч дарна. Гарч ирэх цонхонд хуучин нууц үг болон шинэ нууц үгээ оруулж хадгална.", attributes: [NSAttributedString.Key.font: UIFont.systemFont(ofSize: 16)])
        
        let text7_1 = NSAttributedString(string: "Таны програм ашиглах хугацаа борлуулалт цонхон дээр харагдаж байгаа ба дараах сонголтуудаар лицензээ сунгах боломжтой. \n1.Хаан банкны 5038060153 тоот дансанд төлбөрөө тушаах бөгөөд хүлээн авагчийн нэр дээр Датакейр, гүйлгээний утганд зөвхөн өөрийн нэвтрэх дугаарыг бичнэ. \n2.Та скайтелийн дугаартай бол лиценз сунгах цэсээр орон төлбөр төлөх төрлийг сонгож, сунгах хугацаагаа оруулаад “Нэгжээр“ товч дарахад төлбөрийн мэдээлэлтэй цонхруу шилжиж “Төлөх“ товч дарна. Хэрэв таны дугаар баталгаажаагүй бол дугаар баталгаажуулах цонхонд дугаараа оруулан баталгаажуулах хэрэгтэй. \n3.Мөн та лиценз сунгах цонхноос “Дансаар“ товч дарахад төлбөрийн мэдээлэлтэй цонх гарч ирэх ба “Төлөх“ товч дарахад таны утсан дах интернэт банкны аппликейшныг дуудах болно. Та нэвтрэх нэр, нууц үгээ хийн ороход гүйлгээний мэдээллүүд автоматаар бөглөгдсөн байна. \nЖич: Дансаар товч дарахад гарч ирсэн QR кодыг өөр утаснаас уншуулан Qpay үйлчилгээгээр төлөх боломжтой.\nТөлбөр төлснөөс хойш 5 - 10 минутын дотор таны лиценз сунгагдах болно.", attributes: [NSAttributedString.Key.font: UIFont.systemFont(ofSize: 16)])
        
        let text8_1 = NSAttributedString(string: "НЭГ. НИЙТЛЭГ ҮНДЭСЛЭЛ \n1.1 Энэхүү үйлчилгээний нөхцөл нь “Оньс” гар утасны аппликейшнд хэрэглэгчээр бүртгүүлэх, аппликейшнийг ашиглаж борлуулалтын үйл ажиллагаа явуулахтай холбоотой үүсэх харилцааг зохицуулна. \n1.2 Энэхүү нөхцөл нь хэрэглэгч гар утасны аппликейшнд бүртгүүлж хэрэглэгч болохоос өмнө уншиж танилцан, хүлээн зөвшөөрч баталгаажуулсны үндсэн дээр хэрэгжиж эхэлнэ. \n1.3 Энэхүү нөхцөлийн хэрэгжилтийг “Оньс” гар утасны аппликейшнийг эзэмшигч болон хэрэглэгч хамтран хянана. \n\nХОЁР. ТАЛУУДЫН ЭРХ ҮҮРЭГ \n2.1 Энэхүү гар утасны аппликейшн нь компанийн өмч бөгөөд хэрэглэгч нь лого, нэр, загварыг хуулах, олшруулах, дуурайх, өөр бусад зорилгоор ашиглахыг хориглоно. \n2.2 Тус “Оньс” аппликейшн нь худалдаа, ажил  үйлчилгээ эрхлэгч болон хэрэглэгчдийн борлуулалт хийхэд зориулсан гар утасны аппликейшн байна. \n2.3 Гар утасны аппликейшнийн өгөгдөл хадгалалт, түүний аюулгүй байдал, хэрэглэгчийн мэдээллийн нууцлалыг компани бүрэн хариуцна. \n2.4 Гар утасны аппликейшнийн мэдээллийн шинэчлэлт, үнийн өөрчлөлт, хөнгөлөлт урамшуулал болон шинэ үйлчилгээний талаарх мэдээллийн үнэн зөвийг компани бүрэн хариуцна.\n2.5 Хэрэглэгч нь гуравдагч этгээдэд нэвтрэх дугаар, нууц үгээ дамжуулахгүй байх, аппликейшнаар нэвтрэн орсон үедээ гар утсаа хэн нэгэнд дамжуулахгүй байх, аппликейшн ашиглаагүй үедээ програмаас байнга гарч байх зэргээр өөрийн мэдээллийн аюулгүй байдлыг өөрөө хариуцна. \n2.6 Хэрэглэгч сайн дураар “Оньс” аппликейшнд мэдээллээ бүртгүүлэх бөгөөд мэдээллийн үнэн зөв байдалд хэрэглэгч өөрөө бүрэн хариуцлага хүлээнэ. \n2.7 Компани нь Хууль хяналтын байгууллагын албан ёсны шаардлагаас бусад ямар ч нөхцөлд хэрэглэгчийн оруулсан мэдээллийн нууцыг бусдад дамжуулахгүй чандлан хадгалах бөгөөд зөвхөн хэрэглэгчтэй байгуулсан үйлчилгээний нөхцөлөөр буюу хэрэглэгчийн хүсэлтэнд хариулах, холбоо барихад ашиглана. \n2.8 Хэрэглэгчийн бүртгүүлсэн регистрийн дугаараар НӨАТУС-д борлуулалтын мэдээллийг хуульд заасны дагуу илгээх үүрэгтэй. \n\n ГУРАВ. ГИШҮҮНЧЛЭЛ \n3.1 Хэрэглэгч нь “Оньс” аппликейшнд бүртгүүлж хэрэглэгч болсноор “Оньс”-д өөрийн эрхээрээ нэвтрэх эрхтэй болно. \n3.2 Хэрэглэгч “Оньс” аппликейшнд бүртгүүлэхдээ татвар төлөгчийн регистрийн дугаар, и-мэйл хаяг, нууц үгийг заавал оруулна. \n3.3 Хэрэглэгчийн и-мэйл хаягаар шаардлагатай мэдээллийг илгээх тул нэг и-мэйл хаягаар нэгээс олон хэрэглэгч бүртгүүлэх боломжгүй. \n3.4 Хэрэглэгч бүртгүүлсний дараа лицензийн төлбөрөө төлснөөр бүртгэлээ баталгаажуулах бөгөөд албан ёсны хэрэглэгч болно. \n3.5 Хэрэглэгч худал мэдээлэл оруулах, үүргээ биелүүлээгүй зэрэг үйлдэл гаргавал тухайн гишүүний эрхийг хаана. \n\nДӨРӨВ. ТӨЛБӨР \n4.1 “Оньс” гар утасны аппликейшнийн сарын төлбөр нь 5000 төгрөг, өдрийн төлбөр 200 төгрөг байна. \n4.2  Хэрэглэгч нь лицензийн төлбөрөө ХААН банкны 5038060153 тоот дансанд тушаах бөгөөд гүйлгээний утга хэсэгт өөрийн нэвтрэх дугаарыг заавал бичнэ.Нэвтрэх дугаарыг буруу бичсэн эсвэл огт бичээгүйгээс үүдэн гарах асуудлыг хэрэглэгч өөрөө хариуцна. \n4.3 Хэрэглэгчийн лицензийн хугацаа дууссан тохиолдолд борлуулалт хийх эрх нь хаагдах бөгөөд лицензийн төлбөрөө төлснөөр эрх нь сунгагдана. \n4.4 Хэрэглэгч лицензийн төлбөрөө төлснөөс хойш 2 цагийн дотор програмын лицензийн хугацаа сунгагдана. \n\nТАВ. БУСАД ЗҮЙЛ \n 5.1 Компани нь үйлчилгээний нөхцөлд өөрчлөлт оруулах эрхтэй бөгөөд хэрэглэгч нь үйлчилгээний нөхцөлийн сүүлийн хувилбарыг уншиж байх үүрэгтэй. \n5.2 Хэрэглэгчийн мэдээлэл болон төлбөрийн талаар асуудал үүссэн тохиолдолд 90090889 утсанд холбогдож лавлана. \n5.3 Хэрэглэгчийн гаргасан гомдол, маргаантай асуудлыг тус гар утасны аппликейшний үйлчилгээний нөхцөл болон Монгол улсын хууль дүрмийн дагуу шийдвэрлэнэ.", attributes: [NSAttributedString.Key.font: UIFont.systemFont(ofSize: 16)])
        
        let text9_1 = NSAttributedString(string: "ОНЬС мобайл пос \nДатакейр ХХК \nУтас: 90090889, 76060006 \nВеб: www.datacare.mn \nХаяг : Улаанбаатар хот, Сүхбаатар дүүрэг, Бээжингийн гудамж, Орчлон сургуулийн урд байрлах GB плаза төв, 503 тоот", attributes: [NSAttributedString.Key.font: UIFont.systemFont(ofSize: 16)])
        
        text1.append(text1_1)
        text2.append(text2_1)
        text3.append(text3_1)
        text4.append(text4_1)
        text5.append(text5_1)
        text6.append(text6_1)
        text7.append(text7_1)
        text8.append(text8_1)
        text9.append(text9_1)
        
        listText.append(text1)
        listText.append(text2)
        listText.append(text3)
        listText.append(text4)
        listText.append(text5)
        listText.append(text6)
        listText.append(text7)
        listText.append(text8)
        listText.append(text9)
    }
    
    
    func tableView(_ tableView: UITableView, numberOfRowsInSection section: Int) -> Int {
        return headerList.count
    }
    
    func tableView(_ tableView: UITableView, cellForRowAt indexPath: IndexPath) -> UITableViewCell {
        let cell = tableView.dequeueReusableCell(withIdentifier: "AboutTVCell") as! AboutTVCell
        cell.lblHeader.text = self.headerList[indexPath.row]
        cell.btnDrop.tag = indexPath.row;
        
        if(listExpand[indexPath.row]){
            cell.imgDrop.image = UIImage(named: "expand")
            cell.lblBody.attributedText = listText[indexPath.row]
        }
        else{
            cell.imgDrop.image = UIImage(named: "collapse")
            cell.lblBody.text = nil
        }

        cell.btnDrop.addTarget(self, action: #selector(buttonClick(_ :)), for: .touchUpInside)
        return cell
    }
          
   @objc func buttonClick(_ sender: UIButton) {
       let rowNumber : Int = sender.tag
       self.listExpand[rowNumber] = !self.listExpand[rowNumber]
       self.tableMain.reloadData()
   }
}
